DataProcessors/ПлюсСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ПлюсСервис</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПлюсРасширенияКУстановке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПлюсРасширенияКУстановке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдВерсииРасширения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаУстановку</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдСеанса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдРасширения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлюсУстановленныеРасширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПлюсУстановленныеРасширения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдВерсииРасширения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдРасширенияВИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаУстановку</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтообновлениеОтключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдРасширения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПлюсСервис/Forms/ВзаимодействиеССервисом/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем HTMLДокумент;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПлюсСервис.Используется() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Сервис 1С:Плюс недоступен для использования в данной конфигурации'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ЭтоУстановкаОбновлений = Параметры.ЭтоУстановкаОбновлений;
	ОжидаетсяОповещение = Параметры.ОжидаетсяОповещение;
	
	ЭтоРазделенныйСеанс = ОбщегоНазначения.РазделениеВключено() 
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	АдресПрограммногоИнтерфейса = ПлюсСервис.АдресAPI();
	
	УстановкаРазрешена = Пользователи.ЭтоПолноправныйПользователь() 
		Или Пользователи.ЭтоПолноправныйПользователь(, Истина);
		
	Если ОбщегоНазначения.РазделениеВключено() 
		И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		УстановкаРазрешена = Ложь;
	КонецЕсли;
	
	Если Не ЭтоУстановкаОбновлений Тогда
		Попытка
			ИдентификаторСеанса = ПлюсСервис.СинхронизироватьСписокРасширенийССервисом(
				УстановкаРазрешена, Параметры.ЗаголовокПрограммы);
			АдресИнтерфейса = ПлюсСервис.НавигационнаяСсылкаИнтерфейса(ИдентификаторСеанса);
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Расширения 1С:Плюс.Синхронизация списка расширений'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение НСтр("ru = 'Не удалось подключиться к серверу 1С:Плюс.'");
		КонецПопытки;
	КонецЕсли;
	
	Если УстановкаРазрешена Тогда
		ТекстДокумента = Обработки.ПлюсСервис.ПолучитьМакет("ОжиданиеУстановки").ПолучитьТекст();
		ОбновитьСостояниеРасширений();
	КонецЕсли;
	
	АдресХранилищаДляОбменаДанными = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоУстановкаОбновлений И УстановкаРазрешена Тогда
		ТребуетсяМонопольныйРежим = Истина;
		НачатьУстановку();
		Возврат;
	КонецЕсли;
	
	Если Не ОжидаетсяОповещение Тогда
		ПерейтиПоНавигационнойСсылке(АдресИнтерфейса);
	КонецЕсли;
	
	Если Не УстановкаРазрешена Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Документ = ПолучитьТекстHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Не ИмяСобытия = ПлюсСервисСлужебныйКлиент.СобытиеОповещения() Тогда
		Возврат;
	КонецЕсли;

	Действие = Параметр; // см. ПлюсСервисСлужебныйКлиент.ДействиеРезультатаГлобальногоПоиска
	Если Действие.ДанныеРасширения.Установлено Тогда
		Поиск = Новый Структура;
		Поиск.Вставить("ИдВерсииРасширения",
			Новый УникальныйИдентификатор(Действие.ДанныеРасширения.ИдентификаторВерсии));
		РезультатПоиска = РасширенияКУстановке.НайтиСтроки(Поиск);
		Если РезультатПоиска.Количество() > 0 Тогда
			ИдентификаторСтроки = РезультатПоиска[0].ПолучитьИдентификатор();
			Элементы.РасширенияКУстановке.ТекущаяСтрока = ИдентификаторСтроки;
		КонецЕсли;
	КонецЕсли;

	Если Действие.Команда = ПлюсСервисКлиентСервер.КомандаПосмотретьОписание() Тогда
		АдресПерехода = СтрШаблон("%1&state=%2%3%4", АдресИнтерфейса, ПлюсСервисКлиентСервер.ПолеИдентификаторВерсии(),
			"%3D", Параметр.ДанныеРасширения.ИдентификаторВерсии);
		
		АдресПерехода = СтрШаблон("%1&utm_source=1Capp", АдресПерехода);
		Если Действие.Свойство("КаналUTM") Тогда
			АдресПерехода = СтрШаблон("%1&utm_medium=%2", АдресПерехода, Действие.КаналUTM);
		КонецЕсли;
			
		ПерейтиПоНавигационнойСсылке(АдресПерехода);
	ИначеЕсли Действие.Команда = ПлюсСервисКлиентСервер.КомандаУстановитьРасширение() Тогда
		ДобавитьРасширениеКУстановкеНаСервере(ИдентификаторСеанса, Параметр.ДанныеРасширения.ИдентификаторВерсии);
	ИначеЕсли Действие.Команда = ПлюсСервисКлиентСервер.КомандаОткрытьНастройки() Тогда
		ОткрытьФормуНастроек(
		 	Параметр.ДанныеРасширения.ПубличныйИдентификатор, Параметр.ДанныеРасширения.ИнтерфейсНастроек);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		HTMLДокумент.closeSession();
		Возврат;
	КонецЕсли;
	
	Если ПодтверждениеЗакрытияПолучено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
	ПродолжитьЗакрытие();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ДанныеСобытия.Element.id <> "button1c" Тогда
		Возврат;
	КонецЕсли;
	
	Если HTMLДокумент.resultStatus = 499 Тогда
		Закрыть();
		Возврат;
	ИначеЕсли HTMLДокумент.resultStatus = 0 Тогда
		ПоказатьОкноИнформации(
			НСтр("ru = 'Сервер недоступен или не ответил вовремя. Повторить попытку?'"),
			БиблиотекаКартинок.СинхронизацияДанныхОтключение,
			Ложь,
			Истина);
		Возврат;	
	ИначеЕсли HTMLДокумент.resultStatus <> 200 Тогда
		ПоказатьОкноИнформации(
			НСтр("ru = 'Выполнение запроса завершилось с ошибкой. Повторить попытку?'"),
			БиблиотекаКартинок.СинхронизацияДанныхОтключение,
			Ложь,
			Истина);
		Возврат;
	КонецЕсли;
	
	НастройкиОткрытияФорм = Неопределено;
	ДанныеЗадания = Неопределено;
	
	ПрочитатьДанныеЗаданияJSON(HTMLДокумент.resultText, ДанныеЗадания, НастройкиОткрытияФорм);
	
	Если ЗначениеЗаполнено(НастройкиОткрытияФорм) Тогда
		ОткрытьФормыНастроек(НастройкиОткрытияФорм);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗадания.Extensions) Тогда
		ЗаписатьЗаданиеНаУстановку(ДанныеЗадания);
		НачатьУстановку();
	Иначе
		HTMLДокумент.subscribe();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументДокументСформирован(Элемент)
	
	Если ТипЗнч(Элемент.Документ.defaultView) = Тип("ВнешнийОбъект") Тогда
		HTMLДокумент = Элемент.Документ.defaultView;
	ИначеЕсли ТипЗнч(Элемент.Документ.parentWindow) = Тип("ВнешнийОбъект") Тогда
		HTMLДокумент = Элемент.Документ.parentWindow;
	Иначе
		ВызватьИсключение НСтр("ru = 'Не удалось определить тип браузера'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИнформацияОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(АдресИнтерфейса);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасширенияКУстановке

&НаКлиенте
Процедура РасширенияКУстановкеАвтообновлениеОтключеноПриИзменении(Элемент)
	
	Элементы.РасширенияКУстановке.ТекущиеДанные.Автообновление =
		Не Элементы.РасширенияКУстановке.ТекущиеДанные.Автообновление;	
	
	ПараметрыНовойФормы = Новый Структура(
		"ИдРасширения",
		Элементы.РасширенияКУстановке.ТекущиеДанные.ИдРасширения);
		
	ОткрытьФорму(
		"Обработка.ПлюсСервис.Форма.ФормаВключенияАвтообновления",
		ПараметрыНовойФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВключенияАвтообновления", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенияКУстановкеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РасширенияКУстановкеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РасширенияКУстановкеПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.РасширенияКУстановке.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.РасширенияКУстановкеКонтекстноеМенюИзменитьРасписание.Видимость = Ложь;
	Иначе
		Элементы.РасширенияКУстановкеКонтекстноеМенюИзменитьРасписание.Видимость = ТекущиеДанные.ЕстьКомандыРасширения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСостояниеРасширений();
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьПодключение(Команда)
	ПовторноеПодключение();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВ1СПлюс(Команда)
	ПерейтиПоНавигационнойСсылке(АдресИнтерфейса);
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьРасширение(Команда)
	
	ТекущиеДанные = Элементы.РасширенияКУстановке.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Статус <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(
		СтрШаблон(НСтр("ru = 'Удалить расширение ""%1""?'"), ТекущиеДанные.Имя),
		РежимДиалогаВопрос.ДаНет,,,
		НСтр("ru = 'Удаление расширения'"), );
		
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРасширения = Новый Структура();
	ДанныеРасширения.Вставить("ИдРасширения", ТекущиеДанные.ИдРасширения);
	ДанныеРасширения.Вставить("ИмяРасширения", ТекущиеДанные.Имя);
	ДанныеРасширения.Вставить("ВерсияРасширения", ТекущиеДанные.Версия);
	ДанныеРасширения.Вставить("ИдВерсииРасширения", ТекущиеДанные.ИдВерсииРасширения);
	
	Если ТребуетсяМонопольныйДоступ(ТекущиеДанные.ИдРасширения) Тогда
		
		ПоказатьОкноИнформации(НСтр("ru = 'Установка монопольного режима'"));
		
		Если ЭтоРазделенныйСеанс Тогда
			ПодключитьОбработчикОжидания(ИмяОбработчикаОжиданияУстановкиМонопольногоРежима(), 5);
		Иначе
			Оповещение = Новый ОписаниеОповещения(
				"ПродолжитьУдалениеРасширения",
				ЭтотОбъект,
				ДанныеРасширения);
			ОткрытьФорму(
				"Обработка.ПлюсСервис.Форма.ПредупреждениеМонопольныйРежим",
				Новый Структура("ЭтоУдаление", Истина),
				ЭтотОбъект,,,,
				Оповещение,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ПродолжитьУдалениеРасширения(Истина, ДанныеРасширения);
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьРасписание(Команда)
	
	ТекущиеДанные = Элементы.РасширенияКУстановке.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ИдРасширения", ТекущиеДанные.ИдРасширения);
	ОткрытьФорму("Обработка.ПлюсСервис.Форма.ФормаКомандыРасширения", 
		ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВключенияАвтообновления(Знач РезультатРаботы, Знач ДопПараметры) Экспорт
	
	ОбновитьСостояниеРасширений();
	Если РезультатРаботы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОкноИнформации(
		НСтр("ru = 'Оригинальная версия восстановлена.
		|Перезапустить приложение?'"),
		БиблиотекаКартинок.ПлюсУспех48,
		Истина);
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяМонопольныйДоступ(Знач ИдРасширения)
	
	Если Не ПлюсСервис.РасширениеИзменяетСтруктуруДанных(ИдРасширения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Не УстановитьМонопольныйРежимНаСервере();
	
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьРасширениеНаСервере(Знач ДанныеРасширения)
	
	ПлюсСервис.УдалитьРасширение(ДанныеРасширения);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПродолжитьЗакрытие()
	
	Результат = Ждать ВопросАсинх(
		НСтр("ru = 'Данное окно отвечает за взаимодействие с 1С:Плюс.
			|Если закрыть данное окно в процессе установки расширения, установка будет прервана.
			|Закрыть окно?'"),
		РежимДиалогаВопрос.ДаНет);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодтверждениеЗакрытияПолучено = Истина;
		HTMLДокумент.closeSession();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОкноИнформации(ТекстОжидания, КартинкаДействия = Неопределено,
	ПоказатьКнопкиВопроса = Ложь, ПоказатьКнопкуПовторногоПодключения = Ложь,
	ЗакрытьФорму = Ложь, ТекстОшибки = "")
	
	Если КартинкаДействия = Неопределено Тогда
		КартинкаДействия = БиблиотекаКартинок.ПлюсПрогресс48;
	КонецЕсли;
	
	ПараметрыОтображения = Новый Структура();
	ПараметрыОтображения.Вставить("Картинка", КартинкаДействия);
	ПараметрыОтображения.Вставить("Текст", ТекстОжидания);
	ПараметрыОтображения.Вставить("ПоказатьКнопкиВопроса", ПоказатьКнопкиВопроса);
	ПараметрыОтображения.Вставить("ПоказатьКнопкуПовторногоПодключения", ПоказатьКнопкуПовторногоПодключения);
	ПараметрыОтображения.Вставить("ЗакрытьФорму", ЗакрытьФорму);
	ПараметрыОтображения.Вставить("ТекстОшибки", ТекстОшибки);
	
	ПараметрыНовойФормы = Новый Структура("АдресХранилищаДляОбменаДанными", АдресХранилищаДляОбменаДанными);
	ПараметрыНовойФормы.Вставить("АдресХранилищаДляОбменаДанными", АдресХранилищаДляОбменаДанными);
	ПоместитьВоВременноеХранилище(ПараметрыОтображения, АдресХранилищаДляОбменаДанными);
	
	ОткрытьФорму(
		"Обработка.ПлюсСервис.Форма.ФормаОжиданиеУстановки",
		ПараметрыНовойФормы,
		ЭтотОбъект,
		"УникальныйКлючДляОткрытияФормы",,,,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ПовторноеПодключение() Экспорт
	ПоказатьОкноИнформации("",,,, Истина);
	HTMLДокумент.subscribe();
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановку()
	
	Если ТребуетсяМонопольныйРежим И Не УстановитьМонопольныйРежимНаСервере() Тогда		ПоказатьОкноИнформации(НСтр("ru = 'Установка монопольного режима'"));
		Если ЭтоРазделенныйСеанс Тогда
			ПодключитьОбработчикОжидания(ИмяОбработчикаОжиданияУстановкиМонопольногоРежима(), 5);
		Иначе
			Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыПредупреждения", ЭтотОбъект);
			ОткрытьФорму(
				"Обработка.ПлюсСервис.Форма.ПредупреждениеМонопольныйРежим"
				,Новый Структура("ЭтоУдаление", Ложь),
				ЭтотОбъект,,,,
				Оповещение,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЗапуститьУстановкуРасширений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыПредупреждения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено И Не ПроверитьУстановкуМонопольногоРежима() Тогда
		ПоказатьОкноИнформации(
			НСтр("ru = 'Установка расширения завершилась ошибкой'"),
			БиблиотекаКартинок.ПлюсОшибка48,
			Ложь,
			Ложь,
			Ложь,
			НСтр("ru = 'Не удалось установить монопольный режим'"));
		Возврат;
	КонецЕсли;
	
	НачатьУстановку();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьУстановкуМонопольногоРежима()
	
	Если УстановитьМонопольныйРежимНаСервере() Тогда
		Возврат Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ПлюсСервис.ОчиститьСписокРасширенийКУстановке(ИдентификаторСеанса);
	ОбновитьСостояниеРасширений();
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьУдалениеРасширения(Результат, ДанныеРасширения) Экспорт
	
	Если Результат = Неопределено Тогда
		ПоказатьОкноИнформации("",,,, Истина);
		Возврат;
	КонецЕсли;
	
	ПоказатьОкноИнформации(НСтр("ru = 'Удаление расширения'"),,,,);
	УдалитьРасширениеНаСервере(ДанныеРасширения);
	ОбновитьСостояниеРасширений();
	ПоказатьОкноИнформации(
		НСтр("ru = 'Расширение удалено.
			|Перезапустить приложение?'"),
		БиблиотекаКартинок.ПлюсУспех48,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ИмяОбработчикаОжиданияУстановкиМонопольногоРежима()
	Возврат "Подключаемый_ПроверитьРезультатОжиданияУстановкиМонопольногоРежима";
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьРезультатОжиданияУстановкиМонопольногоРежима()
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания(ИмяОбработчикаОжиданияУстановкиМонопольногоРежима());
	
	Если Не Результат.Успешно Тогда
		ВызватьИсключение Результат.ТекстОшибки;
	КонецЕсли;
	
	ЗапуститьУстановкуРасширений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьУстановкуРасширений()
	
	ПоказатьОкноИнформации(НСтр("ru = 'Установка расширения'"));
	ПодключитьОбработчикОжидания("ПродолжитьУстановкуРасширений", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьУстановкуРасширений()
	
	УстановкаВыполненаУспешно = Истина;
	Попытка
		ЗапуститьУстановкуРасширенийНаСервере();
	Исключение
		УстановкаВыполненаУспешно = Ложь;
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьОкноИнформации(
			НСтр("ru = 'Установка расширения завершилась ошибкой'"),
			БиблиотекаКартинок.ПлюсОшибка48,
			Ложь,
			Ложь,
			Ложь,
			ТекстОшибки);
		ОбновитьСостояниеРасширений();
	КонецПопытки;
			
	ЗавершитьУстановкуРасширений(УстановкаВыполненаУспешно);
	
КонецПроцедуры

&НаСервере
Функция УстановитьМонопольныйРежимНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		УстановитьМонопольныйРежим(Истина);
		Возврат Истина;
	Исключение
		Если Не ЭтоРазделенныйСеанс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецПопытки;
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(АдресРезультата);
	ПараметрыЗадания.Добавить(ПолучитьТекущийСеансИнформационнойБазы().НомерСеанса);
	
	ФоновыеЗадания.Выполнить(
		"ПлюсСервисВМоделиСервиса.НачатьУстановкуМонопольногоРежима",
		ПараметрыЗадания);
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеРасширений()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПлюсРасширенияКУстановке.ИдРасширения КАК ИдРасширения,
	|	ПлюсРасширенияКУстановке.ИдВерсииРасширения КАК ИдВерсииРасширения,
	|	ПлюсРасширенияКУстановке.ИмяРасширения КАК Имя,
	|	ПлюсРасширенияКУстановке.ВерсияРасширения КАК Версия,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаУстановки,
	|	0 КАК Статус,
	|	ЛОЖЬ КАК АвтообновлениеОтключено
	|ИЗ
	|	РегистрСведений.ПлюсРасширенияКУстановке КАК ПлюсРасширенияКУстановке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлюсУстановленныеРасширения.ИдРасширения,
	|	ПлюсУстановленныеРасширения.ИдВерсииРасширения,
	|	ПлюсУстановленныеРасширения.ИмяРасширения,
	|	ПлюсУстановленныеРасширения.ВерсияРасширения,
	|	ПлюсУстановленныеРасширения.ДатаУстановкиОбновления,
	|	1,
	|	ПлюсУстановленныеРасширения.АвтообновлениеОтключено
	|ИЗ
	|	РегистрСведений.ПлюсУстановленныеРасширения КАК ПлюсУстановленныеРасширения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статус,
	|	ДатаУстановки УБЫВ");
	
	Отбор = Новый Структура;
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Отбор.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания.ПлюсЗапускЗаданийРасширений.ИмяМетода);
	Иначе
		Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ПлюсЗапускЗаданийРасширений);
	КонецЕсли;
	
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	РасширенияКУстановке.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = РасширенияКУстановке.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Автообновление = Не Выборка.АвтообновлениеОтключено;
		
		Если Выборка.Статус = 1 И УстановленныеВСеансеРасширения.Количество() <> 0 Тогда
			Отбор = Новый Структура("ИдВерсииРасширения", Выборка.ИдВерсииРасширения);
			Если УстановленныеВСеансеРасширения.НайтиСтроки(Отбор).Количество() > 0 Тогда
				Выборка.Статус = 2;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Задание Из Задания Цикл
			Если Задание.Параметры.Количество() <> 0 И Задание.Параметры[0] = Строка(Выборка.ИдРасширения) Тогда
				НовСтрока.ЕстьКомандыРасширения = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗавершитьУстановкуРасширений(УстановкаЗавершенаУспешно = Истина) Экспорт
	
	Если УстановкаЗавершенаУспешно Тогда
		ОбновитьСостояниеРасширений();
		ПоказатьОкноИнформации(
			НСтр("ru = 'Установка расширения завершена.
			|Перезапустить приложение?'"),
			БиблиотекаКартинок.ПлюсУспех48,
			Истина);
	КонецЕсли;
	
	СнятьМонопольныйРежим();
	ТребуетсяМонопольныйРежим = Ложь;
	
	Если Не ЭтоУстановкаОбновлений Тогда
		HTMLДокумент.subscribe();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СнятьМонопольныйРежим()
	
	Если МонопольныйРежим() Тогда
		УстановитьМонопольныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстHTML()
	
	ДлительностьВызова = 30;
	ТаймаутВызова = (ДлительностьВызова + 10) * 1000;
	Путь = АдресПрограммногоИнтерфейса + СтрШаблон("/%1/WaitingInstall", ИдентификаторСеанса);
	ПутьКЗакрытию = АдресПрограммногоИнтерфейса + СтрШаблон("/%1/Close", ИдентификаторСеанса);
	
	Возврат СтрШаблон(ТекстДокумента, 
			Путь, 
			Формат(ДлительностьВызова, "ЧГ=0;"), 
			Формат(ТаймаутВызова, "ЧГ=0;"),
			ПутьКЗакрытию);
			
КонецФункции

&НаСервере
Процедура ЗаписатьЗаданиеНаУстановку(Знач ЗаданиеНаУстановку)
	
	НайденыРРД = Ложь;
	ПлюсСервис.ЗаписатьЗаданиеНаУстановку(ЗаданиеНаУстановку, ИдентификаторСеанса, НайденыРРД);
	ТребуетсяМонопольныйРежим = НайденыРРД;
	
	ОбновитьСостояниеРасширений();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьРасширениеКУстановкеНаСервере(ИдентификаторСеанса, ИдентификаторВерсии)
	
	ПлюсСервис.ДобавитьРасширениеКУстановке(ИдентификаторСеанса, ИдентификаторВерсии);
	
КонецПроцедуры
	
&НаСервере	
Процедура ПрочитатьДанныеЗаданияJSON(ТелоОтвета, ДанныеЗадания, НастройкиОткрытияФорм)
	
	Попытка
		ДанныеЗадания = ОбщегоНазначения.JSONВЗначение(ТелоОтвета,, Ложь);
		НастройкиОткрытияФорм = Новый Массив;
		Расширения = ДанныеЗадания.Extensions;

		КоличествоЭлементов = Расширения.Количество();
		Для ОбратныйИндекс = 1 По КоличествоЭлементов Цикл
			Элемент = Расширения[КоличествоЭлементов - ОбратныйИндекс];
			Если Элемент.OpenSettings Тогда
				НастройкиОткрытияФормы = НовыйНастройкиОткрытияФормы();
				НастройкиОткрытияФормы.ПубличныйИдентификатор = ОсновнойПубличныйИдентификаторРасширения(Элемент);
				НастройкиОткрытияФормы.ИнтерфейсНастроек = Элемент.SettingsInterface;
				НастройкиОткрытияФормы.ДанныеДляУдаления = Новый Структура("ExtId, ExtVersionId",
					Элемент.ExtId, Элемент.ExtVersionId);
				
				НастройкиОткрытияФорм.Добавить(НастройкиОткрытияФормы);
				Расширения.Удалить(КоличествоЭлементов - ОбратныйИндекс);
			КонецЕсли;
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Расширения 1С:Плюс.Чтение данных для установки'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ОсновнойПубличныйИдентификаторРасширения(ДанныеРасширения)
	
	Если ДанныеРасширения.Свойство("PublicIds") И ДанныеРасширения.PublicIds.Количество() > 0 Тогда
		Возврат ДанныеРасширения.PublicIds[0];
	Иначе
		ВызватьИсключение НСтр("ru = 'Не заполнен публичный идентификатор'");
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗапуститьУстановкуРасширенийНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТребуетсяМонопольныйРежим Тогда
		Если ЭтоРазделенныйСеанс Тогда
			ПлюсСервисВМоделиСервиса.ВыполнитьУстановкуМонопольногоРежима(
				Пользователи.ТекущийПользователь(),
				Неопределено,
				Неопределено,
				Истина);
		ИначеЕсли Не МонопольныйРежим() Тогда 
			УстановитьМонопольныйРежим(Истина);
		КонецЕсли;
	КонецЕсли;
	
	ПлюсСервис.УстановитьРасширения(ЭтоУстановкаОбновлений);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормыНастроек(НастройкиОткрытияФорм)
	
	Для Каждого Настройка Из НастройкиОткрытияФорм Цикл

		ОткрытьФормуНастроек(Настройка.ПубличныйИдентификатор, Настройка.ИнтерфейсНастроек);
		УдалитьЗаданиеИзКорзины(Настройка.ДанныеДляУдаления, ИдентификаторСеанса);

	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(ПубличныйИдентификатор, ИнтерфейсНастроек)

	СтандартнаяОбработка = Истина;
	ПлюсСервисКлиентПереопределяемый.ПриОткрытииФормыНастроек(ПубличныйИдентификатор, СтандартнаяОбработка);

	Если Не СтандартнаяОбработка Или Не ЗначениеЗаполнено(ИнтерфейсНастроек) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ИнтерфейсНастроек, "/") Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнтерфейсНастроек);
	Иначе
		//@skip-check module-unused-local-variable - особенность реализации
		Результат = Вычислить(ИнтерфейсНастроек);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НовыйНастройкиОткрытияФормы()
	
	НастройкиОткрытияФормы = Новый Структура();
	НастройкиОткрытияФормы.Вставить("ПубличныйИдентификатор", "");
	НастройкиОткрытияФормы.Вставить("ИнтерфейсНастроек", "");
	НастройкиОткрытияФормы.Вставить("ДанныеДляУдаления", Новый Структура()); 
	
	Возврат НастройкиОткрытияФормы;
	 
КонецФункции


&НаСервереБезКонтекста
Процедура УдалитьЗаданиеИзКорзины(ДанныеДляУдаления, ИдентификаторСеанса)
	
	ПлюсСервис.УдалитьРасширениеИзКорзины(ДанныеДляУдаления, ИдентификаторСеанса);
	
КонецПроцедуры

#КонецОбласти
